
///////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСобытия = Параметры.ПараметрыСобытия;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Показатели.Количество() = 0 Тогда
		ИнтерфейсыКлиент.Предупредить("Необходимо выбрать хотя бы один показатель производительности");
		Возврат;
	КонецЕсли;
	
	Если Не Сохранить(СтруктураПараметров) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ЗапаковатьПараметры(СтруктураПараметров));
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// РАБОТА С ДАННЫМИ

&НаСервере
// Загрузить параметры события
//
Процедура Загрузить()
	
	СтруктураПараметров = ПараметрыСобытия.Получить();
	ВсеПоказатели = СтруктураПараметров.Все;
	
	Для Каждого Показатель Из СтруктураПараметров.Показатели Цикл
		СтрокаПоказателя = Показатели.Добавить();
		СтрокаПоказателя.Показатель = Показатель;
	КонецЦикла;
	
КонецПроцедуры // Загрузить()

&НаСервере
// Сохранить параметры события
//
Функция Сохранить(СтруктураПараметров)
	
	СтруктураПараметров.Показатели = Показатели.Выгрузить(, "Показатель").ВыгрузитьКолонку("Показатель");
	СтруктураПараметров.Все = ВсеПоказатели;
	ПараметрыСобытия = Новый ХранилищеЗначения(СтруктураПараметров);
	
	Возврат Истина;
	
КонецФункции // Сохранить()


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ЗапаковатьПараметры(СтруктураПараметров)
	
	Возврат Новый ХранилищеЗначения(СтруктураПараметров);
	
КонецФункции // ЗапаковатьПараметры()

