
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция РаспаковатьПараметрыКоманды(ПараметрыКомандыХранилище) Экспорт
	
	Возврат ПараметрыКомандыХранилище.Получить();
	
КонецФункции // ПолучитьПараметрыСобытия()
