
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОтладкиПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементовУправления()
	
	Элементы.ПоказыватьОтладочныеСообщения.Доступность = НаборКонстант.РежимОтладки;
	Элементы.НеУдалятьСлужебныеДанные.Доступность = НаборКонстант.РежимОтладки;
	
КонецПроцедуры // УстановитьДоступностьЭлементовУправления()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ОбновитьРежимОтладки();
	ОбновитьИнтервалОбновленияПодключенийРП();
	ОбновитьПоказыватьОтладочныеСообщения();
	ОбновитьНеУдалятьСлужебныеДанные();
	ОбновитьЗапрашиватьПодтверждениеПриЗавершении();
	КомандыКлиент.ВыполнитьКоманду(ПредопределенноеЗначение("Справочник.Команды.ОбновитьИнтерфейсПользователя"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	глКонстанты = КонтекстВызовСервера.ИнициализироватьКэшКонстант();
	ОбновитьПоказыватьПредупреждения();
	ОбновитьЗапрашиватьПодтверждениеПриЗавершении();
	
КонецПроцедуры


