
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстПредупреждения = Параметры.ТекстПредупреждения;
	ПоказыватьВСледующийРаз = Константы.ПоказыватьПредупреждения.Получить();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПоказыватьВСледующийРазПриИзмененииНаСервере(ПоказыватьВСледующийРаз)
	
	Константы.ПоказыватьПредупреждения.Установить(ПоказыватьВСледующийРаз);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьВСледующийРазПриИзменении(Элемент)
	ПоказыватьВСледующийРазПриИзмененииНаСервере(ПоказыватьВСледующийРаз);
	ОбновитьПоказыватьПредупреждения();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Закрыть(Истина);
	
КонецПроцедуры
