
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(ЭтотОбъект.ПериодОбновления) Тогда
		ЭтотОбъект.ПериодОбновления = "0";
		ЭтотОбъект.Элементы.Список.АвтоОбновление = Ложь;
	КонецЕсли;
	
	УстановитьАвтообновлениеСписка();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	УстановитьАвтообновлениеСписка();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПериодОбновленияЧисло = Число(ЭтотОбъект.ПериодОбновления);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ПериодОбновленияПриИзменении(Элемент)
	
	ПериодОбновленияЧисло = Число(ЭтотОбъект.ПериодОбновления);	
	Если ПериодОбновленияЧисло > 0 Тогда
		ЭтотОбъект.Элементы.Список.ПериодАвтоОбновления = ПериодОбновленияЧисло;
		ЭтотОбъект.Элементы.Список.АвтоОбновление = Истина;
	Иначе
		ЭтотОбъект.Элементы.Список.АвтоОбновление = Ложь;
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьСписок(Команда)
    
    ЭтотОбъект.Элементы.Список.Обновить();
    
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьАвтообновлениеСписка()
	
	ПериодОбновленияЧисло = Число(ЭтотОбъект.ПериодОбновления);	
	Если ПериодОбновленияЧисло > 0 Тогда
		ЭтотОбъект.Элементы.Список.ПериодАвтоОбновления = ПериодОбновленияЧисло;
		ЭтотОбъект.Элементы.Список.АвтоОбновление = Истина;
	Иначе
		ЭтотОбъект.Элементы.Список.АвтоОбновление = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти




