
Процедура ПередЗаписью(Отказ)
	
	Если ДополнительныеСвойства.Свойство("НачальноеЗаполнение") Тогда
		Возврат;
	КонецЕсли;
	
	Незаполненный = ОбщегоНазначенияКлиентСервер.НайтиНезаполненныйРеквизит(
		ЭтотОбъект, "Наименование");
	
	Если Незаполненный <> Неопределено Тогда
		Отказ = Истина;
		Синоним = ОбщегоНазначенияКлиентСервер.СинонимРеквизита(ЭтотОбъект.Метаданные().Реквизиты, Незаполненный);
		Сообщить(СловарьКлиентСервер.Получить("ЗначениеНеЗаполнено", Синоним));
	КонецЕсли;
	
	Для Каждого СтрокаТЖ Из ИменаКаталоговТЖ Цикл
		СтрокаТЖ.Локальный = ОбщегоНазначенияКлиентСервер.СкорректироватьПуть(СтрокаТЖ.Локальный);
		СтрокаТЖ.Сетевой = ОбщегоНазначенияКлиентСервер.СкорректироватьПуть(СтрокаТЖ.Сетевой);
	КонецЦикла;
	
	Справочники.Показатели.ОбновитьПоказателиПроизводительности(Серверы, СчетчикиОС);
	
КонецПроцедуры // ПередЗаписью()
