
///////////////////////////////////////////////////////////////////////////////
// ПРЕДСТАВЛЕНИЯ КОМАНД И ИХ ПАРАМЕТРОВ

// Получение представления команды
//
//  Команда - Перечисление.Команда
//  ПараметрКоманды - Произвольный
//
// Возвращаемое значение:
//  Строка - представление команды
//
Функция ПредставлениеПараметровКоманды(Команда, ПараметрКоманды) Экспорт
	
	Перем Результат;
	
	Попытка
		КодКоманды = ПолучитьКодКоманды(Команда);
		Если ПараметрКоманды <> Неопределено Тогда
			Выполнить "Результат = ПредставлениеПараметровКоманды" + КодКоманды + "(ПараметрКоманды);";
		Иначе
			Результат = "";
		КонецЕсли;
	Исключение
		Результат = Строка(ПараметрКоманды);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции // ПредставлениеСобытия()

// Получить представление параметра команды ИзменитьПараметр
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыИзменитьПараметр(ПараметрКоманды)
	
	Возврат Строка(ПараметрКоманды.Параметр) + " = " + ПараметрКоманды.Значение;
	
КонецФункции // ПредставлениеПараметровКомандыИзменитьПараметр()

// Получить представление параметра команды УстановитьТаймер
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыУстановитьТаймер(ПараметрКоманды)
	
	Возврат Строка(ПараметрКоманды.Имя) + ", " + ПараметрКоманды.Длительность + " сек.";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьТаймер()

// Получить представление параметра команды ВключитьЗаписьЗначенийПП
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыВключитьЗаписьЗначенийПП(ПараметрКоманды)
	
	Если ПараметрКоманды.ДлительностьЗаписи = 0 Тогда
		Длительность = "";
	Иначе
		Длительность = " на " + Формат(ПараметрКоманды.ДлительностьЗаписи, "ЧГ=0") + " сек.";
	КонецЕсли;
	
	Если ПараметрКоманды.НеЗаписывать = Истина Тогда
		Дополнительно =
			", если "
			+ """" + ПараметрКоманды.ДополнительныйПоказатель + """"
			+ " в зоне (" + ПараметрКоманды.ЗонаДополнительногоПоказателя + ")"
			+ " менее " + ПараметрКоманды.МаксимальнаяДлительностьВЗоне + " сек.";
	Иначе
		Дополнительно = "";
	КонецЕсли;
	
	Показатель = Строка(ПараметрКоманды.Показатель);
	
	Если Не ПустаяСтрока(Показатель) Тогда
		Показатель = """" + Показатель + """";
	КонецЕсли;
	
	Возврат Показатель + Длительность + Дополнительно;
	
КонецФункции // ПредставлениеПараметровКомандыВключитьЗаписьЗначенийПП()

// Получить представление параметра команды ВыполнитьСценарий
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыВыполнитьСценарий(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыВключитьЗаписьЗначенийПП()

// Получить представление параметра команды Стоп
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыСтоп(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыСтоп()

// Получить представление параметра команды ДобавитьПП
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыДобавитьПП(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыДобавитьПП()

// Получить представление параметра команды УстановитьПозицию
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыУстановитьПозицию(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьПозицию()

// Получить представление параметра команды ИзменитьМасштаб
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыИзменитьМасштаб(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьПозицию()

// Получить представление параметра команды ОбновитьПросмотрПоказателей
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыОбновитьПросмотрПоказателей(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьПозицию()

// Получить представление параметра команды ВыключитьМонитор
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыВыключитьМонитор(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьПозицию()

// Получить представление параметра команды ИзменитьПозицию
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыИзменитьПозицию(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыИзменитьПозицию()

// Получить представление параметра команды УстановитьЧастотуМониторинга
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыУстановитьЧастотуМониторинга(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьЧастотуМониторинга()

// Получить представление параметра команды ВыключитьМониторинг
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыВыключитьМониторинг(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыВыключитьМониторинг()

// Получить представление параметра команды ВыключитьПросмотр
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыВыключитьПросмотр(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыВыключитьПросмотр()

// Получить представление параметра команды ВыделитьПоказатель
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыВыделитьПоказатель(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыВыделитьПоказатель()

// Получить представление параметра команды ВыключитьЗаписьЗначенийПП
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыВыключитьЗаписьЗначенийПП(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыВыключитьЗаписьЗначенийПП()

// Получить представление параметра команды СписокЗакладок
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыСписокЗакладок(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыСписокЗакладок()

// Получить представление параметра команды УстановитьИнтервалПросмотра
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыУстановитьИнтервалПросмотра(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьИнтервалПросмотра()

// Получить представление параметра команды ДобавитьЗакладку
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыДобавитьЗакладку(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыДобавитьЗакладку()

// Получить представление параметра команды УстановитьМасштаб
//
// Параметры:
//  ПараметрКоманды - Структура (Параметр, Значение)
//
// Возвращаемое значение:
//  Строка - представление параметра
//
Функция ПредставлениеПараметровКомандыУстановитьМасштаб(ПараметрКоманды)
	
	Возврат "";
	
КонецФункции // ПредставлениеПараметровКомандыУстановитьМасштаб()


///////////////////////////////////////////////////////////////////////////////
// ВЫПОЛНЕНИЕ КОМАНД

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьКодКоманды(Команда) Экспорт
	
	#Если Сервер Тогда
		глКоманды = КонтекстВызовСервера.ПолучитьОписаниеКоманд();
	#КонецЕсли
	
	КодКоманды = глКоманды.Получить(Команда);
	
	Возврат КодКоманды;
	
КонецФункции // ПолучитьКодКоманды()


///////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ

// Служебная процедура, необходимая для корректного прохождения
// проверки "Поиск неиспользуемых процедур и функций"
//
// Параметры:
//  Нет
//
Процедура ВызовыНеявноИспользуемыхПроцедурИФункций()
	
	Если Ложь Тогда
		
		ПредставлениеПараметровКомандыВключитьЗаписьЗначенийПП(Неопределено);
		ПредставлениеПараметровКомандыВыделитьПоказатель(Неопределено);
		ПредставлениеПараметровКомандыВыключитьЗаписьЗначенийПП(Неопределено);
		ПредставлениеПараметровКомандыВыключитьМонитор(Неопределено);
		ПредставлениеПараметровКомандыВыключитьМониторинг(Неопределено);
		ПредставлениеПараметровКомандыВыключитьПросмотр(Неопределено);
		ПредставлениеПараметровКомандыВыполнитьСценарий(Неопределено);
		ПредставлениеПараметровКомандыДобавитьПП(Неопределено);
		ПредставлениеПараметровКомандыИзменитьМасштаб(Неопределено);
		ПредставлениеПараметровКомандыИзменитьПараметр(Неопределено);
		ПредставлениеПараметровКомандыИзменитьПозицию(Неопределено);
		ПредставлениеПараметровКомандыОбновитьПросмотрПоказателей(Неопределено);
		ПредставлениеПараметровКомандыСтоп(Неопределено);
		ПредставлениеПараметровКомандыУстановитьПозицию(Неопределено);
		ПредставлениеПараметровКомандыУстановитьТаймер(Неопределено);
		ПредставлениеПараметровКомандыУстановитьЧастотуМониторинга(Неопределено);
		ПредставлениеПараметровКомандыСписокЗакладок(Неопределено);
		ПредставлениеПараметровКомандыУстановитьИнтервалПросмотра(Неопределено);
		ПредставлениеПараметровКомандыДобавитьЗакладку(Неопределено);
		ПредставлениеПараметровКомандыУстановитьМасштаб(Неопределено);
		
		ВызовыНеявноИспользуемыхПроцедурИФункций();
		
	КонецЕсли;
	
КонецПроцедуры // ВызовыНеявноИспользуемыхПроцедурИФункций()
