
Перем мЭтоНовый; // Флаг, записан ли документ в базу данных.


// Процедура обработки события ПередЗаписью документа.
// Определяет записан ли документ в базу данных.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мЭтоНовый = ЭтоНовый();
	
КонецПроцедуры // ПередЗаписью()

// Процедура обработки события ПриЗаписи документа.
// Записать движение в регистры.
//
Процедура ПриЗаписи(Отказ)
	
	Перем ПричинаОшибки;
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	// Получить ссылку на показатель производительности
	Если ТипБлокировки = Перечисления.ТипыБлокировок.Блокировка1СПредприятия Тогда
		Показатель = Справочники.Показатели.АнализВзаимоблокировок1С;
	Иначе
		Показатель = Справочники.Показатели.АнализВзаимоблокировок;
	КонецЕсли;
	Значение = 1;
	
	Попытка
		ЖурналПоказателей.ЗаписатьЗначениеПоказателяАнализа(
			ЭтотОбъект,
			мЭтоНовый,
			Показатель,
			Значение);
	Исключение
		Отказ = Истина;
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры // ПриЗаписи()

// Процедура обработки события ПередУдалением документа.
// Удаляет движения документа.
//
Процедура ПередУдалением(Отказ)
	
	Перем ПричинаОшибки;
	
	// Получить ссылку на показатель производительности
	Показатель = Справочники.Показатели.АнализВзаимоблокировок;
	Значение = 1;
	
	Попытка
		ЖурналПоказателей.УдалитьЗначениеПоказателяАнализа(
			ЭтотОбъект,
			мЭтоНовый,
			Показатель,
			Значение);
	Исключение
		Отказ = Истина;
		ВызватьИсключение;
	КонецПопытки
	
КонецПроцедуры // ПередУдалением()