///////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокСценариев();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарииПриАктивизацииСтроки(Элемент)
	
	Описание = Элемент.ТекущиеДанные.Описание;
	ОбновитьСостояниеЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	
	ОбработатьВыборСценария();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОбработатьВыборСценария();
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Заполнить список доступных сценариев
//
Процедура ЗаполнитьСписокСценариев()
	
	Исключения = Новый Массив;
	Исключения.Добавить(Справочники.Сценарии.Базовый);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Исключения", Исключения);
	Запрос.Текст = "
		|ВЫБРАТЬ
		|	Сценарии.Ссылка,
		|	Сценарии.Наименование КАК Наименование,
		|	Сценарии.Описание
		|ИЗ
		|	Справочник.Сценарии КАК Сценарии
		|ГДЕ
		|	(НЕ Сценарии.Ссылка В (&Исключения))
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сценарии.Предопределенный УБЫВ,
		|	Сценарии.Наименование";
	
	Сценарии.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры // ЗаполнитьСписокСценариев()

&НаКлиенте
// Обновить состояние элементов управления
//
Процедура ОбновитьСостояниеЭлементовУправления()
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаВыбрать.Доступность = 
		(Элементы.Сценарии.ТекущаяСтрока <> Неопределено);
	
КонецПроцедуры // ОбновитьСостояниеЭлементовУправления()

&НаКлиенте
Процедура ОбработатьВыборСценария()
	
	Сценарий = Элементы.Сценарии.ТекущиеДанные.Ссылка;
	ОповеститьОВыборе(Сценарий);
	
КонецПроцедуры
