///////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ

// Получить значение параметра по имени
//
// Параметры:
//  ИмяПараметра - Строка
//
// Возвращаемое значение:
//  Составной, значение параметра
Функция ПолучитьЗначениеПараметра(ИмяПараметра) Экспорт
	
	СтрокаПараметра = ЭтотОбъект.Параметр.Найти(ИмяПараметра, "Имя");
	
	Если СтрокаПараметра = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ТипПараметра = ВРег(СтрокаПараметра.Тип);
	Если ТипПараметра = "BOOLEAN" Тогда
		Возврат Булево(СтрокаПараметра.Значение);
	ИначеЕсли ТипПараметра = "INTEGER" Тогда
		Возврат Число(СтрокаПараметра.Значение);
	ИначеЕсли ТипПараметра = "STRING" Тогда
		Возврат Строка(СтрокаПараметра.Значение);
	Иначе
		Возврат СтрокаПараметра.Значение;
	КонецЕсли;
	
КонецФункции // ПолучитьЗначениеПараметра()

// Установить значение параметра
//
// Параметры:
//  ИмяПараметра - Строка
//  Значение - Составной
//
Процедура УстановитьЗначениеПараметра(ИмяПараметра, Значение) Экспорт
	
	СтрокаПараметра = ЭтотОбъект.Параметр.Найти(ИмяПараметра, "Имя");
	
	Если СтрокаПараметра = Неопределено Тогда
		СтрокаПараметра = ЭтотОбъект.Параметр.Добавить();
		СтрокаПараметра.Имя = ИмяПараметра;
	КонецЕсли;
	
	СтрокаПараметра.Значение = Значение;
	
КонецПроцедуры // УстановитьЗначениеПараметра()

// Получить значение параметра минимальной длительности запроса
//
// Возвращаемое значение:
//  Число - минимальная длительность запроса
//
Функция ПолучитьМинимальнуюДлительностьЗапроса() Экспорт
	
	МинимальнаяДлительностьЗапроса = ПолучитьЗначениеПараметра("Минимальная длительность запроса (сек.)");
	
	Если МинимальнаяДлительностьЗапроса = Неопределено Тогда
		МинимальнаяДлительностьЗапроса = 2;
	КонецЕсли;
	
	Возврат МинимальнаяДлительностьЗапроса;
	
КонецФункции // ПолучитьМинимальнуюДлительностьЗапроса()

// Получить значение параметра минимальной длительности серверного вызова
//
// Возвращаемое значение:
//  Число - минимальная длительность
//
Функция ПолучитьМинимальнуюДлительностьСерверногоВызова() Экспорт
	
	МинимальнаяДлительностьВызова = ПолучитьЗначениеПараметра("Минимальная длительность вызова (сек.)");
	
	Если МинимальнаяДлительностьВызова = Неопределено Тогда
		МинимальнаяДлительностьВызова = 2;
	КонецЕсли;
	
	Возврат МинимальнаяДлительностьВызова;
	
КонецФункции // ПолучитьМинимальнуюДлительностьСерверногоВызова()

// Определить необходимость получения планов запросов
//
// Возвращаемое значение:
//  Булево - необходимость получения планов запросов
//
Функция ПолучатьПланыЗапросов() Экспорт
	
	Планы = ПолучитьЗначениеПараметра("Получать планы запросов");
	
	Если Планы = Неопределено Тогда
		Планы = Истина;
	КонецЕсли;
	
	Возврат Планы;
	
КонецФункции // ПолучатьПланыЗапросов()
