Перем мЭтоНовый; // Флаг, записан ли документ в базу данных.

// Процедура обработки события ПередЗаписью документа.
// Определяет записан ли документ в базу данных.
//
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	мЭтоНовый = ЭтоНовый();
	
КонецПроцедуры

// Процедура обработки события ПриЗаписи документа.
// Записать движение в регистры.
//
Процедура ПриЗаписи(Отказ)
	
	Если ТипВыполнения = Перечисления.ТипыВыполненийКода.СерверныйВызов Тогда
		Показатель = Справочники.Показатели.АнализСерверныхВызовов;
		Значение = 1;
		
		ЖурналПоказателей.ЗаписатьЗначениеПоказателяАнализа(ЭтотОбъект, мЭтоНовый, Показатель, Значение);
	КонецЕсли;
	
КонецПроцедуры

// Процедура обработки события ПередУдалением документа.
// Удаляет движения документа.
//
Процедура ПередУдалением(Отказ)
	
	Если ТипВыполнения = Перечисления.ТипыВыполненийКода.СерверныйВызов Тогда
		Показатель = Справочники.Показатели.АнализСерверныхВызовов;
		Значение = 1;
		
		ЖурналПоказателей.УдалитьЗначениеПоказателяАнализа(ЭтотОбъект, мЭтоНовый, Показатель, Значение);
	КонецЕсли;
	
КонецПроцедуры

