////////////////////////////////////////////////////////////////////////////////
// Обработчики событий подсистем конфигурации.

// См. ОбщегоНазначенияКлиентПереопределяемый.ПриНачалеРаботыСистемы.
Процедура ПриНачалеРаботыСистемы(ПараметрыПроцедуры) Экспорт
	
	ОбщегоНазначения.ДобавитьПараметрыРаботыКлиента(ПараметрыПриложения);
	
	Инициализировать();
	
КонецПроцедуры


// Подготовка монитора производительности к запуску
//
Процедура Инициализировать()
	
	ПараметрыКлиента = СлужебныйКлиент.ПараметрыРаботыКлиентаПриЗапуске();
	
	ОтладкаКлиентСервер.Действие("ИнициализироватьЦУП");
	
	Служебный.ИнициализироватьНаСервере();
	
	// Выполнить базовый сценарий
	Контекст.ИнициализироватьОписаниеКоманд();
	Контекст.ИнициализироватьОписаниеПоказателей();
	Контекст.ИнициализироватьКэшКонстант();
	Контекст.Создать(ПредопределенноеЗначение("Справочник.Сценарии.Базовый"));
	ПриВыполненииСценария();
	
	ФормаМонитора(Истина);
	
	// Показать форму приветствия
	Если ПараметрыПриложения["ПоказыватьПриветствиеПриЗапускеЦУП"] Тогда
		ОткрытьФорму("ОбщаяФорма.Приветствие");
	КонецЕсли;
	
	// Установить обработчик замеров
	ОтладкаКлиентСервер.Результат("ИнициализироватьЦУП");
	
КонецПроцедуры // Инициализировать()
