
///////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСобытия = Параметры.ПараметрыСобытия;
	Загрузить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ПовторятьПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ЗначениеЗаполнено(Зона) Тогда
		ИнтерфейсыКлиент.Предупредить("Не указана зона");
		Возврат;
	КонецЕсли;
	
	Если Показатели.Количество() = 0 Тогда
		ИнтерфейсыКлиент.Предупредить("Необходимо выбрать хотя бы один показатель производительности");
		Возврат;
	КонецЕсли;
	
	Если Не Сохранить(СтруктураПараметров) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(ЗапаковатьПараметры(СтруктураПараметров));
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// РАБОТА С ДАННЫМИ

&НаСервере
// Загрузить параметры события
//
Процедура Загрузить()
	
	СтруктураПараметров = ПараметрыСобытия.Получить();
	УстановитьСписокЗон(Элементы.Зона.СписокВыбора);
	Зона = СтруктураПараметров.Зона;
	ВсеПоказатели = СтруктураПараметров.Все;
	Длительность = СтруктураПараметров.Длительность;
	Повторять = СтруктураПараметров.Повтор >= 0;
	ПериодичностьПовторов = ?(СтруктураПараметров.Повтор >= 0, СтруктураПараметров.Повтор, 0);
	
	Для Каждого Показатель Из СтруктураПараметров.Показатели Цикл
		СтрокаПоказателя = Показатели.Добавить();
		СтрокаПоказателя.Показатель = Показатель;
	КонецЦикла;
	
КонецПроцедуры // Загрузить()

&НаСервере
// Сохранить параметры события
//
Функция Сохранить(СтруктураПараметров)
	
	СтруктураПараметров.Зона = Зона;
	СтруктураПараметров.Показатели = Показатели.Выгрузить(, "Показатель").ВыгрузитьКолонку("Показатель");
	СтруктураПараметров.Все = ВсеПоказатели;
	СтруктураПараметров.Длительность = Длительность;
	СтруктураПараметров.Повтор = ?(Повторять, ПериодичностьПовторов, -1);
	ПараметрыСобытия = Новый ХранилищеЗначения(СтруктураПараметров);
	
	Возврат Истина;
	
КонецФункции // Сохранить()


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Заполнить список зон
//
// Параметры:
//  СписокЗон - СписокЗначений, заполняемый список
//
Процедура УстановитьСписокЗон(СписокЗон)
	
	СписокЗон.Очистить();
	
	Для Каждого ЗонаПП Из Перечисления.ЗоныЗначенийПоказателей Цикл
		СписокЗон.Добавить(ЗонаПП);
	КонецЦикла;
	
КонецПроцедуры // УстановитьСписокЗон()

&НаСервере
// Установить доступность элементов управления
//
Процедура УстановитьДоступностьЭлементовУправления()
	
	Элементы.ПериодичностьПовторов.Доступность = Повторять;
	
КонецПроцедуры // УстановитьДоступностьЭлементовУправления()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервереБезКонтекста
Функция ЗапаковатьПараметры(СтруктураПараметров)
	
	Возврат Новый ХранилищеЗначения(СтруктураПараметров);
	
КонецФункции // ЗапаковатьПараметры()

