
Процедура ЗагрузитьШаблон(ШаблонЭлемента) Экспорт
	Если ШаблонЭлемента <> Неопределено Тогда
		ЭтотОбъект.Наименование = ШаблонЭлемента["Наименование"];
		ЭтотОбъект.Описание = ШаблонЭлемента["Описание"];
		
		ЭтотОбъект.НациональноеПредставление.Очистить();
		Для Каждого ТекЯзык Из ШаблонЭлемента["Языки"] Цикл
			НовСтрока = ЭтотОбъект.НациональноеПредставление.Добавить();
			НовСтрока.Язык = ТекЯзык.Ключ;
			НовСтрока.НаименованиеНациональное = ТекЯзык.Значение;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

