
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьКодСобытия(Событие) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Событие.Код КАК Код
	               |ИЗ
	               |	Справочник.События КАК Событие
	               |ГДЕ
	               |	Событие.Ссылка = &Событие";
	
	Запрос.УстановитьПараметр("Событие", Событие);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат СокрЛП(Выборка.Код);
	
КонецФункции // ПолучитьКодКоманды()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция РаспаковатьПараметрыСобытия(ПараметрыСобытияХранилище) Экспорт
	
	Возврат ПараметрыСобытияХранилище.Получить();
	
КонецФункции // ПолучитьПараметрыСобытия()
