
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Ключ") Тогда
		СтандартнаяОбработка = Ложь;
		Если Параметры.Ключ.Тип = Перечисления.ТипыРесурсов.ОбъектМетаданных Тогда
			ВыбраннаяФорма = "ФормаОбъектаМетаданных";
			
		ИначеЕсли Параметры.Ключ.Тип = Перечисления.ТипыРесурсов.Таблица Тогда
			ВыбраннаяФорма = "ФормаТаблицы";
			
		ИначеЕсли Параметры.Ключ.Тип = Перечисления.ТипыРесурсов.Индекс Тогда
			ВыбраннаяФорма = "ФормаИндекса";
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
