
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИБ = Параметры.ИнформационнаяБаза;
	ВидГраницы = Параметры.ВидГраницы;
	
	Если Не ЗначениеЗаполнено(ИБ) Тогда
		Отказ = Истина;
		Сообщить(СловарьКлиентСервер.Получить("ОшибкаНеВыбранаИБ"));
		Возврат;
	КонецЕсли;
	
	Список.КомпоновщикНастроек.Настройки.Отбор.Элементы[0].ПравоеЗначение = ИБ;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		РезультатВыбора = Новый Структура("Значение,ВидГраницы", Элемент.ТекущиеДанные.Период, ВидГраницы);
		ОповеститьОВыборе(РезультатВыбора);
	КонецЕсли;
	
КонецПроцедуры