
// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьИдентификаторОбъекта(ОписаниеИБ, ИмяТаблицы) Экспорт
	
	Идентификатор = Неопределено;
	
	ПодключениеСУБД = КипВнешнийКомпонент.ПолучитьMSSQL();
	MSSQL.ПодключитьMSSQL(ПодключениеСУБД, ОписаниеИБ);
	
	ИмяБД = ОписаниеИБ.ИмяБД;
	ТекстЗапроса = "use [" + ИмяБД + "]";
	КипВнешнийКомпонент.ВыполнитьЗапросMSSQL(ПодключениеСУБД, ТекстЗапроса);
	
	ТекстЗапроса = 
		"select object_id('" + ИмяТаблицы + "') as ObjectID";
	КипВнешнийКомпонент.ВыполнитьЗапросMSSQL(ПодключениеСУБД, ТекстЗапроса);
	ЕстьРезультат = КипВнешнийКомпонент.ЕстьРезультатMSSQL(ПодключениеСУБД);
	Если ЕстьРезультат Тогда
		КипВнешнийКомпонент.СледующаяЗаписьMSSQL(ПодключениеСУБД);
		Идентификатор = КипВнешнийКомпонент.ЗначениеПоляMSSQL(ПодключениеСУБД, "ObjectID");
	КонецЕсли;
	
	Возврат Идентификатор;
	
КонецФункции // ПолучитьИдентификаторОбъекта()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьИдентификаторыОбъекта(ОписаниеИБ, ИмяТаблицы) Экспорт
	
	ТаблицаИдентификаторов = Новый ТаблицаЗначений;
	ТаблицаИдентификаторов.Колонки.Добавить("ObjectID");
	ТаблицаИдентификаторов.Колонки.Добавить("ObjectID2");
	
	ПодключениеСУБД = КипВнешнийКомпонент.ПолучитьMSSQL();
	MSSQL.ПодключитьMSSQL(ПодключениеСУБД, ОписаниеИБ);
	
	ИмяБД = ОписаниеИБ.ИмяБД;
	ТекстЗапроса = "use [" + ИмяБД + "]";
	КипВнешнийКомпонент.ВыполнитьЗапросMSSQL(ПодключениеСУБД, ТекстЗапроса);
	
	ТекстЗапроса = 
		"select distinct
		|	sp.object_id as ObjectID,
		|	'' as ObjectID2
		|from sys.partitions sp
		|	left join sys.indexes si
		|	on sp.object_id = si.object_id AND sp.index_id = si.index_id
		|where
		|	object_name(sp.object_id) = '" + ИмяТаблицы + "'
		|union all
		|select
		|	'' as ObjectID,
		|	sp.hobt_id as ObjectID2
		|from sys.partitions sp
		|	left join sys.indexes si
		|	on sp.object_id = si.object_id AND sp.index_id = si.index_id
		|where
		|	object_name(sp.object_id) = '" + ИмяТаблицы + "'";
	
	КипВнешнийКомпонент.ВыполнитьЗапросMSSQL(ПодключениеСУБД, ТекстЗапроса);
	ЕстьРезультат = КипВнешнийКомпонент.ЕстьРезультатMSSQL(ПодключениеСУБД);
	Если ЕстьРезультат Тогда
		Пока КипВнешнийКомпонент.СледующаяЗаписьMSSQL(ПодключениеСУБД) Цикл
			ObjectID = КипВнешнийКомпонент.ЗначениеПоляMSSQL(ПодключениеСУБД, "ObjectID");
			Если ObjectID = "0" Тогда
				ObjectID = Неопределено;
			КонецЕсли;
			ObjectID2 = КипВнешнийКомпонент.ЗначениеПоляMSSQL(ПодключениеСУБД, "ObjectID2");
			Если ObjectID2 = "0" Тогда
				ObjectID2 = Неопределено;
			КонецЕсли;
			
			НоваяСтрока = ТаблицаИдентификаторов.Добавить();
			НоваяСтрока.ObjectID = ObjectID;
			НоваяСтрока.ObjectID2 = ObjectID2;
		КонецЦикла;
	КонецЕсли;
	
	Возврат ТаблицаИдентификаторов;
	
КонецФункции // ПолучитьИдентификаторыОбъекта()


// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьОписаниеОбъектаПоObjectID(ОписаниеИБ, ObjectID, ObjectID2) Экспорт
	
	ПодключениеСУБД = КипВнешнийКомпонент.ПолучитьMSSQL();
	MSSQL.ПодключитьMSSQL(ПодключениеСУБД, ОписаниеИБ);
	
	ОписаниеТаблицы = Новый Структура("ИмяТаблицы,ИмяИндекса,ТипОбъекта");
	
	Если Не ЗначениеЗаполнено(ObjectID) И Не ЗначениеЗаполнено(ObjectID2) Тогда
		Возврат ОписаниеТаблицы;
	КонецЕсли;
	
	ИмяБД = ОписаниеИБ.ИмяБД;
	ТекстЗапроса = "use [" + ИмяБД + "]";
	КипВнешнийКомпонент.ВыполнитьЗапросMSSQL(ПодключениеСУБД, ТекстЗапроса);
	
	Если ЗначениеЗаполнено(ObjectID) И ObjectID <> "0"  Тогда
		ТекстЗапроса = 
			"select object_name(" + ObjectID + ") as ObjectName,
			|'' as IndexName,
			|0 as ObjectType";
	ИначеЕсли ЗначениеЗаполнено(ObjectID2) Тогда
		ТекстЗапроса = 
			"select
			|	object_name(sp.object_id) as ObjectName,
			|	si.name as IndexName,
			|	isnull(si.index_id, 0) as ObjectType
			|from sys.partitions sp
			|left join sys.indexes si
			|	on sp.object_id = si.object_id AND sp.index_id = si.index_id
			|where
			|	sp.hobt_id = " + ObjectID2;
	КонецЕсли;
	
	КипВнешнийКомпонент.ВыполнитьЗапросMSSQL(ПодключениеСУБД, ТекстЗапроса);
	ЕстьРезультат = КипВнешнийКомпонент.ЕстьРезультатMSSQL(ПодключениеСУБД);
	Если ЕстьРезультат Тогда
		КипВнешнийКомпонент.СледующаяЗаписьMSSQL(ПодключениеСУБД);
		ОписаниеТаблицы.ИмяТаблицы = КипВнешнийКомпонент.ЗначениеПоляMSSQL(ПодключениеСУБД, "ObjectName");
		ОписаниеТаблицы.ИмяИндекса = КипВнешнийКомпонент.ЗначениеПоляMSSQL(ПодключениеСУБД, "IndexName");
		ОписаниеТаблицы.ТипОбъекта = КипВнешнийКомпонент.ЗначениеПоляMSSQL(ПодключениеСУБД, "ObjectType");
	КонецЕсли;
	
	Возврат ОписаниеТаблицы;
	
КонецФункции // ПолучитьОписаниеОбъектаПоObjectID()

