&НаКлиенте
Перем мСтруктураПараметров;

///////////////////////////////////////////////////////////////////////////////
// СТАНДАРТНЫЕ ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыКоманды = Параметры.ПараметрыКоманды;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Загрузить();
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьНаВремяПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовУправления();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если Не ЗначениеЗаполнено(Показатель) Тогда
		ИнтерфейсыКлиент.Предупредить("Не указан показатель производительности");
		Возврат;
	КонецЕсли;
	
	Если НеЗаписывать Тогда
		Если Не ЗначениеЗаполнено(ДополнительныйПоказатель) Тогда
			ИнтерфейсыКлиент.Предупредить("Не указан дополнительный показатель производительности");
			Возврат;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ЗонаДополнительногоПоказателя) Тогда
			ИнтерфейсыКлиент.Предупредить("Не указана зона дополнительного показателя производительности");
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не Сохранить(мСтруктураПараметров) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть(Истина);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// РАБОТА С ДАННЫМИ

&НаСервере
// Загрузить параметры события
//
Процедура Загрузить()
	
	мСтруктураПараметров = ПараметрыКоманды.Получить();
	Показатель = мСтруктураПараметров.Показатель;
	ДлительностьЗаписи = мСтруктураПараметров.ДлительностьЗаписи;
	ВключитьНаВремя = ДлительностьЗаписи > 0;
	
	НеЗаписывать = мСтруктураПараметров.НеЗаписывать;
	
	Если НеЗаписывать Тогда
		ДополнительныйПоказатель = мСтруктураПараметров.ДополнительныйПоказатель;
		ЗонаДополнительногоПоказателя = мСтруктураПараметров.ЗонаДополнительногоПоказателя;
		МаксимальнаяДлительностьВЗоне = мСтруктураПараметров.МаксимальнаяДлительностьВЗоне;
	КонецЕсли;
	
КонецПроцедуры // Загрузить()

&НаСервере
// Сохранить параметры события
//
Функция Сохранить(мСтруктураПараметров)
	
	мСтруктураПараметров.Показатель = Показатель;
	мСтруктураПараметров.ДлительностьЗаписи = ?(ВключитьНаВремя, ДлительностьЗаписи, 0);
	мСтруктураПараметров.НеЗаписывать = НеЗаписывать;
	мСтруктураПараметров.ДополнительныйПоказатель = ДополнительныйПоказатель;
	мСтруктураПараметров.ЗонаДополнительногоПоказателя = ЗонаДополнительногоПоказателя;
	мСтруктураПараметров.МаксимальнаяДлительностьВЗоне = МаксимальнаяДлительностьВЗоне;
	Параметры = Новый ХранилищеЗначения(мСтруктураПараметров);
	
	Возврат Истина;
	
КонецФункции // Сохранить()


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаСервере
// Установить доступность элементов управления
//
Процедура УстановитьДоступностьЭлементовУправления()
	
	Элементы.ДлительностьЗаписи.Доступность = ВключитьНаВремя;
	Элементы.ДополнительныйПоказатель.Доступность = НеЗаписывать;
	Элементы.ЗонаДополнительногоПоказателя.Доступность = НеЗаписывать;
	Элементы.МаксимальнаяДлительностьВЗоне.Доступность = НеЗаписывать;
	
КонецПроцедуры // УстановитьДоступностьЭлементовУправления()


