// Обработчик проведения замера
// Если замер буферный, то он пишет по одной записи в каждый регистр
//
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	// Не обрабатывать обычные замеры
	Если Буферный Или Наполнитель Тогда
		
		КоличествоДвижений = ?(Наполнитель, 2000, 1);
		Период = Дата;
		
		Для Каждого Движение Из Движения Цикл
			Для Сч = 1 По КоличествоДвижений Цикл
				СтрокаДвижений = Движение.Добавить();
				СтрокаДвижений.Период = Период;
				Период = Период + 1;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроведения()

Процедура ПередУдалением(Отказ)
	
	// Не обрабатывать буферный замеры
	Если Буферный Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередУдалением()
