
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура ВключитьОбработкуЗамеров(ОбрабатыватьЗамерыТолькоНаИнтервале) Экспорт
	
	ПараметрыМонитора = ПолучитьПараметрыМонитораАнализа();
	Задание.ВключитьОбработкуЗамеров(ПараметрыМонитора, ОбрабатыватьЗамерыТолькоНаИнтервале);
	
КонецПроцедуры // ВключитьОбработкуЗамеров()

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
Функция ПолучитьПараметрыМонитораАнализа() Экспорт
	
	ИБ = Контекст.ИнформационнаяБаза();
	НачалоИнтервала = Контекст.НачалоИнтервала();
	КонецИнтервала = Контекст.КонецИнтервала();
	
	СтруктураПараметров = Новый Структура(
		"ИБ,НачалоИнтервала,КонецИнтервала",
		ИБ,
		НачалоИнтервала,
		КонецИнтервала
	);
	
	Возврат СтруктураПараметров;
	
КонецФункции // ПолучитьПараметрыМонитораАнализа()
