#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
    
#Область ПрограммныйИнтерфейс

Функция ПолучитьЗначения(АгентЦКК, ДатаЗамера = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегСвТекЗнач.СчетчикПроизводительности КАК СчетчикПроизводительности,
	               |	РегСвТекЗнач.Значение КАК Значение,
	               |	РегСвТекЗнач.ДатаЗамера КАК ДатаЗамера
	               |ИЗ
	               |	РегистрСведений.ТекущиеЗначенияПроизводительности КАК РегСвТекЗнач
	               |ГДЕ
	               |	РегСвТекЗнач.АгентЦКК = &АгентЦКК
	               |	И (РегСвТекЗнач.ДатаЗамера >= &ДатаЗамера ИЛИ &БезОтбораПоДате)";
	
	Запрос.УстановитьПараметр("АгентЦКК", АгентЦКК);
	Запрос.УстановитьПараметр("ДатаЗамера", ДатаЗамера);
	Запрос.УстановитьПараметр("БезОтбораПоДате", ДатаЗамера = Неопределено);
	
	Результат = Запрос.Выполнить();
	
	СчетчикиЗначения = Новый Соответствие;
	
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СчетчикиЗначения.Вставить(Выборка.СчетчикПроизводительности, Новый Структура("Значение,ДатаЗамера", Выборка.Значение, Выборка.ДатаЗамера));
		
	КонецЦикла;
	
	Возврат СчетчикиЗначения;
	
КонецФункции

Процедура Очистить(Оборудование) Экспорт
    
    Запрос = Новый Запрос;
    
    Запрос.Текст = "
    |ВЫБРАТЬ ПЕРВЫЕ 1
    |   АгентЦКК
    |ИЗ
    |   РегистрСведений.ТекущиеЗначенияПроизводительности КАК РегСвТекЗнач
    |ГДЕ
    |   АгентЦКК = &Оборудование
    |";
    
    Запрос.УстановитьПараметр("Оборудование", Оборудование);
    
    Результат = Запрос.Выполнить();
    
    Если НЕ Результат.Пустой() Тогда
        НаборЗаписей = СоздатьНаборЗаписей();
        НаборЗаписей.Отбор.Сервер.Установить(Оборудование);
        НаборЗаписей.Записать(Истина);
    КонецЕсли;
        
КонецПроцедуры

#КонецОбласти

#КонецЕсли